{
  "id": "da0c9f12-38a2-48b9-8aed-4b8d37708d74",
  "productName": "SaberStix Light-Up Chopsticks",
  "tagline": "Eat like a Jedi. Dine like a hero.",
  "description": "SaberStix Light-Up Chopsticks bring a galactic twist to every meal. Crafted for movie fans and food lovers alike, these LED-powered utensils glow with the iconic energy-blade aesthetic while staying completely food-safe and reusable. Perfect for sushi nights, themed parties, cosplay-worthy dinners, or as a standout collectible gift, SaberStix turn ordinary dining into an interstellar experience.\n\nEach pair features a bright LED glow with an easy on/off switch, four vibrant energy colors to match your mood or menu, and BPA-free acrylic construction for safe, long-lasting use. Detachable handles make cleaning a breeze and ensure quick, hassle-free washing. Batteries are included so you can ignite your dinner right out of the box. Whether you’re building a sci-fi kitchen display or simply want to add a little fun to mealtime, SaberStix delivers memorable moments with every bite.",
  "keyFeatures": [
    "Bright LED glow with convenient on/off switch",
    "Available in four energy colors: Blue, Red, Green, Purple",
    "Safe, BPA-free acrylic construction",
    "Detachable handles for easy cleaning and dishwasher-friendly maintenance"
  ],
  "specifications": {
    "Dimensions": "Approximately 8.5 inches (21.5 cm) long; 0.3 inches (0.8 cm) diameter",
    "Weight": "Approximately 2.4 oz (68 g) per pair",
    "Material": "BPA-free acrylic with integrated LED components",
    "Color": "Blue, Red, Green, Purple (color variants)"
  },
  "pricing": {
    "currency": "USD",
    "price": 19.99
  },
  "benefits": [
    "Adds a unique, galaxy-inspired flair to meals and gatherings",
    "Reusable and easy to clean with detachable handles",
    "Perfect for gifts, parties, and collectors of themed merchandise"
  ],
  "targetAudience": "Sci-fi and fantasy fans, teenagers and adults who love novelty gadgets, collectors of themed merchandise, and gift buyers seeking a playful, standout kitchen accessory",
  "category": "Kitchen & Dining / Novelty Gifts",
  "tags": [
    "lightsaber chopsticks",
    "LED chopsticks",
    "geek gifts",
    "sci-fi kitchenware",
    "novelty utensils"
  ],
  "imageUrl": "/uploads/b369ffc1-6b7a-4303-bfa1-fa7967717150.png",
  "createdAt": "2025-10-13T14:00:30.974Z",
  "slug": "saberstix-light-up-chopsticks"
}